Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF248.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF2SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF2SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF08">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF2SID3" edc:desc="" edc:mask="0x1" edc:name="RXF2SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID4" edc:desc="" edc:mask="0x1" edc:name="RXF2SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID5" edc:desc="" edc:mask="0x1" edc:name="RXF2SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID6" edc:desc="" edc:mask="0x1" edc:name="RXF2SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID7" edc:desc="" edc:mask="0x1" edc:name="RXF2SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID8" edc:desc="" edc:mask="0x1" edc:name="RXF2SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID9" edc:desc="" edc:mask="0x1" edc:name="RXF2SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID10" edc:desc="" edc:mask="0x1" edc:name="RXF2SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF2SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF2SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF09">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF2EID16" edc:desc="" edc:mask="0x1" edc:name="RXF2EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID17" edc:desc="" edc:mask="0x1" edc:name="RXF2EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF2EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF2EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID0" edc:desc="" edc:mask="0x1" edc:name="RXF2SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID1" edc:desc="" edc:mask="0x1" edc:name="RXF2SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2SID2" edc:desc="" edc:mask="0x1" edc:name="RXF2SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF2EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF2EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF0A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF2EID8" edc:desc="" edc:mask="0x1" edc:name="RXF2EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID9" edc:desc="" edc:mask="0x1" edc:name="RXF2EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID10" edc:desc="" edc:mask="0x1" edc:name="RXF2EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID11" edc:desc="" edc:mask="0x1" edc:name="RXF2EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID12" edc:desc="" edc:mask="0x1" edc:name="RXF2EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID13" edc:desc="" edc:mask="0x1" edc:name="RXF2EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID14" edc:desc="" edc:mask="0x1" edc:name="RXF2EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID15" edc:desc="" edc:mask="0x1" edc:name="RXF2EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF2EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF2EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF0B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF2EID0" edc:desc="" edc:mask="0x1" edc:name="RXF2EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID1" edc:desc="" edc:mask="0x1" edc:name="RXF2EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID2" edc:desc="" edc:mask="0x1" edc:name="RXF2EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID3" edc:desc="" edc:mask="0x1" edc:name="RXF2EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID4" edc:desc="" edc:mask="0x1" edc:name="RXF2EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID5" edc:desc="" edc:mask="0x1" edc:name="RXF2EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID6" edc:desc="" edc:mask="0x1" edc:name="RXF2EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF2EID7" edc:desc="" edc:mask="0x1" edc:name="RXF2EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF3SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF3SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF0C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF3SID3" edc:desc="" edc:mask="0x1" edc:name="RXF3SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID4" edc:desc="" edc:mask="0x1" edc:name="RXF3SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID5" edc:desc="" edc:mask="0x1" edc:name="RXF3SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID6" edc:desc="" edc:mask="0x1" edc:name="RXF3SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID7" edc:desc="" edc:mask="0x1" edc:name="RXF3SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID8" edc:desc="" edc:mask="0x1" edc:name="RXF3SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID9" edc:desc="" edc:mask="0x1" edc:name="RXF3SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID10" edc:desc="" edc:mask="0x1" edc:name="RXF3SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF3SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF3SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF0D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF3EID16" edc:desc="" edc:mask="0x1" edc:name="RXF3EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID17" edc:desc="" edc:mask="0x1" edc:name="RXF3EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF3EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF3EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID0" edc:desc="" edc:mask="0x1" edc:name="RXF3SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID1" edc:desc="" edc:mask="0x1" edc:name="RXF3SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3SID2" edc:desc="" edc:mask="0x1" edc:name="RXF3SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF3EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF3EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF0E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF3EID8" edc:desc="" edc:mask="0x1" edc:name="RXF3EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID9" edc:desc="" edc:mask="0x1" edc:name="RXF3EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID10" edc:desc="" edc:mask="0x1" edc:name="RXF3EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID11" edc:desc="" edc:mask="0x1" edc:name="RXF3EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID12" edc:desc="" edc:mask="0x1" edc:name="RXF3EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID13" edc:desc="" edc:mask="0x1" edc:name="RXF3EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID14" edc:desc="" edc:mask="0x1" edc:name="RXF3EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID15" edc:desc="" edc:mask="0x1" edc:name="RXF3EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF3EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF3EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF3EID0" edc:desc="" edc:mask="0x1" edc:name="RXF3EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID1" edc:desc="" edc:mask="0x1" edc:name="RXF3EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID2" edc:desc="" edc:mask="0x1" edc:name="RXF3EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID3" edc:desc="" edc:mask="0x1" edc:name="RXF3EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID4" edc:desc="" edc:mask="0x1" edc:name="RXF3EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID5" edc:desc="" edc:mask="0x1" edc:name="RXF3EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID6" edc:desc="" edc:mask="0x1" edc:name="RXF3EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF3EID7" edc:desc="" edc:mask="0x1" edc:name="RXF3EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF4SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF4SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF4SID3" edc:desc="" edc:mask="0x1" edc:name="RXF4SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID4" edc:desc="" edc:mask="0x1" edc:name="RXF4SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID5" edc:desc="" edc:mask="0x1" edc:name="RXF4SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID6" edc:desc="" edc:mask="0x1" edc:name="RXF4SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID7" edc:desc="" edc:mask="0x1" edc:name="RXF4SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID8" edc:desc="" edc:mask="0x1" edc:name="RXF4SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID9" edc:desc="" edc:mask="0x1" edc:name="RXF4SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF4SID10" edc:desc="" edc:mask="0x1" edc:name="RXF4SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
