Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF248.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF54">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1EID0" edc:desc="" edc:mask="0x1" edc:name="RXB1EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID1" edc:desc="" edc:mask="0x1" edc:name="RXB1EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID2" edc:desc="" edc:mask="0x1" edc:name="RXB1EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID3" edc:desc="" edc:mask="0x1" edc:name="RXB1EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID4" edc:desc="" edc:mask="0x1" edc:name="RXB1EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID5" edc:desc="" edc:mask="0x1" edc:name="RXB1EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID6" edc:desc="" edc:mask="0x1" edc:name="RXB1EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID7" edc:desc="" edc:mask="0x1" edc:name="RXB1EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="RXB1DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="RXB1DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xF55">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESB0" edc:desc="" edc:mask="0x1" edc:name="RESB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESB1" edc:desc="" edc:mask="0x1" edc:name="RESB1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1DLC0" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1DLC1" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1DLC2" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1DLC3" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1RB0" edc:desc="" edc:mask="0x1" edc:name="RXB1RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1RB1" edc:desc="" edc:mask="0x1" edc:name="RXB1RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1RTR" edc:desc="" edc:mask="0x1" edc:name="RXB1RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF56">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D00" edc:desc="" edc:mask="0x1" edc:name="RXB1D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D01" edc:desc="" edc:mask="0x1" edc:name="RXB1D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D02" edc:desc="" edc:mask="0x1" edc:name="RXB1D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D03" edc:desc="" edc:mask="0x1" edc:name="RXB1D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D04" edc:desc="" edc:mask="0x1" edc:name="RXB1D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D05" edc:desc="" edc:mask="0x1" edc:name="RXB1D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D06" edc:desc="" edc:mask="0x1" edc:name="RXB1D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D07" edc:desc="" edc:mask="0x1" edc:name="RXB1D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF57">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D10" edc:desc="" edc:mask="0x1" edc:name="RXB1D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D11" edc:desc="" edc:mask="0x1" edc:name="RXB1D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D12" edc:desc="" edc:mask="0x1" edc:name="RXB1D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D13" edc:desc="" edc:mask="0x1" edc:name="RXB1D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D14" edc:desc="" edc:mask="0x1" edc:name="RXB1D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D15" edc:desc="" edc:mask="0x1" edc:name="RXB1D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D16" edc:desc="" edc:mask="0x1" edc:name="RXB1D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D17" edc:desc="" edc:mask="0x1" edc:name="RXB1D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF58">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D20" edc:desc="" edc:mask="0x1" edc:name="RXB1D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D21" edc:desc="" edc:mask="0x1" edc:name="RXB1D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D22" edc:desc="" edc:mask="0x1" edc:name="RXB1D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D23" edc:desc="" edc:mask="0x1" edc:name="RXB1D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D24" edc:desc="" edc:mask="0x1" edc:name="RXB1D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D25" edc:desc="" edc:mask="0x1" edc:name="RXB1D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D26" edc:desc="" edc:mask="0x1" edc:name="RXB1D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D27" edc:desc="" edc:mask="0x1" edc:name="RXB1D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF59">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D30" edc:desc="" edc:mask="0x1" edc:name="RXB1D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D31" edc:desc="" edc:mask="0x1" edc:name="RXB1D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D32" edc:desc="" edc:mask="0x1" edc:name="RXB1D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D33" edc:desc="" edc:mask="0x1" edc:name="RXB1D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D34" edc:desc="" edc:mask="0x1" edc:name="RXB1D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D35" edc:desc="" edc:mask="0x1" edc:name="RXB1D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D36" edc:desc="" edc:mask="0x1" edc:name="RXB1D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D37" edc:desc="" edc:mask="0x1" edc:name="RXB1D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
